package Doit_전체문제;

import java.util.Scanner;

/**
 *  백준 12891번
 *  DNA 비밀번호
 *
 *
 *  [입력]
 *
 *  [출력]
 *
 *  ------              ------
 *  입력값                출력값
 *  ------              ------
 *
 *
 *  ---------------------------------------------------------------------------------------------
 *  [HINT]
 *  1. S배열과 비밀번호 체크 배열을 저장합니다.
 *  2. 윈도우에 포함된 문자로 현재 상태 배열을 만듭니다.
 *     현재 상태 배열과 비밀번호 체크 배열을 비교하여 유효 비밀번호인지 판단합니다.
 *  3. 윈도우 한칸씩 이동하며 배열을 업데이트하고 업데이트 한 후 비밀번호 체크 배열과 비교하여 비밀번호 유효성을 판단합니다.
 *  [CHECK]
 *
 */
public class Doit09 {
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);
        sc.nextInt();


    }
}
